Autodesk.Revit.DB.IFCExportOptions.AddOption(System.String,System.String)
Adds a new named option to the options structure.
Remarks:
Named options can be used to set options not accessible through the standard IFC export user interface.
It is up to the implementation of the IExporterIFC interface to customize export behavior based on these options.
name:
The option name.
value:
The option value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFCExportOptions.Assign(Autodesk.Revit.DB.IFCExportOptions)
Assigns the values of the IFCExportOptions to this options object.
sourceOptions:
The source IFCExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFCExportOptions.FilterViewId
Id of the view whose visibility settings will govern the contents in the exported IFC file.
This should be set to the id of the view, or InvalidElementId if there is to be no special filtering applied (all model elements
will be exported).  Default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.SpaceBoundaryLevel
Level of space boundaries exported in IFC file.
Remarks:
There are three valid values for this integer:
0 = export no space boundaries.  This can save space if the receiving application doesn't use them.
1 = export 1st level space boundaries.  This is the default.
2 = export 2nd level space boundaries.  This is primarily for use in energy analysis programs, and the GSA.
Default is 1.
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.FamilyMappingFile
Path to a file containing family mapping.
Remarks:
The file, if specified, contains data describing how to map
generic family instances to IFC containers (element types). This property
may be empty, in which case the current mapping will be used.
The default is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.ExportBaseQuantities
Option to export IFC standard quantities currently supported by Revit.
Remarks:
IFC has created a list of common quantities (e.g. length, area, volume, etc.)
that can optionally be exported along with the 3D representation for many element
types (e.g. walls, columns, doors). Setting this option to true will cause the export
procedure to include the set of IFC quantities that Revit currently supports.
Default is false.
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.WallAndColumnSplitting
Option to allow division of multi-level walls and columns by levels.
Remarks:
This option will always be considered true when FileVersion is IFC-BCA.
For other File Versions, default is false.
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.FileVersion
IFC file version.
Remarks:
Default is IFCVersion.Default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.#ctor(Autodesk.Revit.DB.IFCExportOptions)
Creates a copy of an IFCExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.#ctor
Default constructor. Initializes FileVersion to Default.
WallAndColumnSplitting and ExportBaseQuantities are set to false.
FamilyMappingFile is set to empty.
Since:
2011

Autodesk.Revit.DB.IFCExportOptions
IFC Export options.
Since:
2011